Documents/бит_ПодключениеУслугКЗданиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ПодключениеУслугКЗданиям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СведенияПоУслугамЛС</xr:Item>
				<xr:Item>InformationRegister.бит_ШаблоныУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийПодключениеУслугКЗданиям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ШаблоныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ШаблоныУслуг</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацийПодключениеУслугКЗданиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийПодключениеУслугКЗданиям</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_ПодключениеУслугКЗданиям/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

Перем мВалютаРегламентированногоУчета Экспорт; // Хранит валюту регламентированного учета.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на. 
// Экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// По переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "" Тогда
		ТабДокумент = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура();
	
КонецФункции

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбеспечениеПроведенияДокумента

// Процедура выполняет проверку заполнения шапки и таб. частей.
//
// Параметры:
// Отказ - булево,
// Заголовок  – Строка.
Процедура ПроверкаРеквизитов(Отказ,Заголовок)
	
	// Проверим заполнение шапки.
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Услуга");
	СтруктураОбязательныхПолей.Вставить("Организация");
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,  СтруктураОбязательныхПолей,   Отказ, Заголовок);
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Адреса".
//
// Параметры: 
//  ТаблицаУслуги - результат запроса, содержащий данные для проведения и проверки ТЧ Адреса.
//  СтруктураШапкиДокумента   - структура, содержащая реквизиты шапки документа и результаты запроса по шапке.
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиАдреса(ТаблицаАдреса, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ИмяТабличнойЧасти = "Адреса";
	
	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура();
	СтруктураОбязательныхПолей.Вставить("Улица");
	СтруктураОбязательныхПолей.Вставить("Здание");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Проверим остатки.
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ОтключениеУслуги Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
		|			&Период,
		|			УслугаЖКХ = &Услуга
		|				И ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						бит_ЛицевыеСчета.Ссылка
		|					ИЗ
		|						Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|					ГДЕ
		|						бит_ЛицевыеСчета.Ссылка.УлицаЛицевогоСчета В (&СписокУлиц)
		|						И бит_ЛицевыеСчета.Ссылка.Здание В (&СписокЗданий))) КАК бит_НачисленияПоУслугамЖКХОстатки";
		Запрос.УстановитьПараметр("Период", ?(ЭтоНовый(),Дата,МоментВремени()));
		Запрос.УстановитьПараметр("Услуга", Услуга);
		Запрос.УстановитьПараметр("СписокУлиц", Адреса.ВыгрузитьКолонку("Улица"));
		Запрос.УстановитьПараметр("СписокЗданий", Адреса.ВыгрузитьКолонку("Здание"));
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Отказ = Истина;

			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "По отключаемой услуге имеются остатки:";
			Сообщение.Сообщить();
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Лицевой счет <"+Выборка.ЛицевойСчет+"> по улице <"+Выборка.ЛицевойСчет.УлицаЛицевогоСчета+"> здание <"+Выборка.ЛицевойСчет.Здание+">";
				Сообщение.Сообщить();
				
			КонецЦикла;
		КонецЕсли;
		
		Если Не Отказ Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	бит_СведенияПоУслугамЛССрезПоследних.Период,
			|	бит_СведенияПоУслугамЛССрезПоследних.Регистратор,
			|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
			|ИЗ
			|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
			|			&Период,
			|			Услуга = &Услуга
			|				И ЛицевойСчет В
			|					(ВЫБРАТЬ
			|						бит_ЛицевыеСчета.Ссылка
			|					ИЗ
			|						Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
			|					ГДЕ
			|						бит_ЛицевыеСчета.Ссылка.УлицаЛицевогоСчета В (&СписокУлиц)
			|						И бит_ЛицевыеСчета.Ссылка.Здание В (&СписокЗданий))) КАК бит_СведенияПоУслугамЛССрезПоследних
			|ГДЕ
			|	НАЧАЛОПЕРИОДА(бит_СведенияПоУслугамЛССрезПоследних.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ДатаДокумента, МЕСЯЦ)";
			Запрос.УстановитьПараметр("Период", ?(ЭтоНовый(),Дата,МоментВремени()));
			Запрос.УстановитьПараметр("ДатаДокумента", Дата);
			Запрос.УстановитьПараметр("Услуга", Услуга);
			Запрос.УстановитьПараметр("СписокУлиц", ТаблицаАдреса.ВыгрузитьКолонку("Улица"));
			Запрос.УстановитьПараметр("СписокЗданий", ТаблицаАдреса.ВыгрузитьКолонку("Здание"));
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Отказ = Истина;
				Выборка = Результат.Выбрать();
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Услугу для конкретного лицевого счета можно редактировать не более одного раза в месяц. Попытка повторного редактирования услуги:";
				Сообщение.Сообщить();
				
				Пока Выборка.Следующий() Цикл
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "По адресу: улица <"+Выборка.ЛицевойСчет.УлицаЛицевогоСчета+
					"> здание <"+Выборка.ЛицевойСчет.Здание+
					"> - лицевой счет <"+Выборка.ЛицевойСчет+
					"> в текущем месяце редактировался документом <"+Выборка.Регистратор+">!";
					Сообщение.Сообщить();
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса по табличной части "Адреса",
//  СтруктураШапкиДокумента   - структура, содержащая реквизиты шапки документа и результаты запроса по шапке.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуАдресов(РезультатЗапросаПоАдресам, СтруктураШапкиДокумента)
	
	ТаблицаАдреса = РезультатЗапросаПоАдресам.Выгрузить();
	
	Возврат ТаблицаАдреса;
	
КонецФункции

// Выполняет подготовительное заполнение таблиц для документа.
//
// Параметры: 
//  ТаблицаАдреса             - пустая таблица  ТЧ Адреса.
//  СтруктураШапкиДокумента   - структура, содержащая реквизиты шапки документа и результаты запроса по шапке.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаАдреса) Экспорт
	
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "Адреса".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Улица"	, "Улица");
	СтруктураПолей.Вставить("Здание"      	, "Здание");
	
	РезультатЗапросаПоАдресам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Адреса", СтруктураПолей);
	
	// Подготовим таблицы услуг для проведения.
	ТаблицаАдреса = ПодготовитьТаблицуАдресов(РезультатЗапросаПоАдресам, СтруктураШапкиДокумента);
	
КонецПроцедуры	

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаАдреса,Отказ,Заголовок)
	
	НаборЗаписейШаблоны = Движения.бит_ШаблоныУслуг;
	НаборЗаписейСведенияПоУслугам = Движения.бит_СведенияПоУслугамЛС;
	
	Для Каждого ТекСтрока Из ТаблицаАдреса Цикл
		СтрокаДвижений = НаборЗаписейШаблоны.Добавить();
		СтрокаДвижений.Период = СтруктураШапкиДокумента.Дата;
		СтрокаДвижений.Услуга = СтруктураШапкиДокумента.Услуга;
		СтрокаДвижений.Улица  = ТекСтрока.Улица;
		СтрокаДвижений.Здание = ТекСтрока.Здание;
		Если СтруктураШапкиДокумента.ВидОперации = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ПодключениеУслуги Тогда
			СтрокаДвижений.Использовать = Перечисления.ДаНет.Да;
		Иначе
			СтрокаДвижений.Использовать = Перечисления.ДаНет.Нет;
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ОтключениеУслуги Тогда
		// Надо отключить услуги в лицевых счетах.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	бит_СведенияПоУслугамЛССрезПоследних.Период,
		|	бит_СведенияПоУслугамЛССрезПоследних.Регистратор,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
		|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
		|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|			&Период,
		|			Услуга = &Услуга
		|				И Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
		|				И ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						бит_ЛицевыеСчета.Ссылка
		|					ИЗ
		|						Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|					ГДЕ
		|						бит_ЛицевыеСчета.Ссылка.УлицаЛицевогоСчета В (&СписокУлиц)
		|						И бит_ЛицевыеСчета.Ссылка.Здание В (&СписокЗданий))) КАК бит_СведенияПоУслугамЛССрезПоследних";
		Запрос.УстановитьПараметр("Период", ?(ЭтоНовый(),Дата,МоментВремени()));
		Запрос.УстановитьПараметр("Услуга", Услуга);
		Запрос.УстановитьПараметр("СписокУлиц", ТаблицаАдреса.ВыгрузитьКолонку("Улица"));
		Запрос.УстановитьПараметр("СписокЗданий", ТаблицаАдреса.ВыгрузитьКолонку("Здание"));
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = НаборЗаписейСведенияПоУслугам.Добавить();
			Движение.Период 		= СтруктураШапкиДокумента.Дата;
			Движение.ЛицевойСчет 	= Выборка.ЛицевойСчет;
			Движение.Услуга 		= Выборка.Услуга;
			Движение.РежимПотребления = Выборка.РежимПотребления;
			Движение.Поставщик 		= Выборка.Поставщик;
			Движение.СпособРасчета 	= Выборка.СпособРасчета;
			Движение.КоличествоЕдиницПотребления = Выборка.КоличествоЕдиницПотребления;
			Движение.Использовать 	= Перечисления.ДаНет.Нет;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаАдреса; // Хранит адреса.
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;
	
	ПроверкаРеквизитов(Отказ,Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаАдреса);
	
	ПроверитьЗаполнениеТабличнойЧастиАдреса(ТаблицаАдреса, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Выполним движения.
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаАдреса,Отказ,Заголовок);
	КонецЕсли; 
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка, Ложь);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_ОбщегоНазначения.ПередЗаписьюДокументаДляУдаленияДвиженийПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ДанныеЗаполнения.Свойство("ВидОперации") Тогда
			
			ВидОперации = ДанныеЗаполнения.ВидОперации;
			
		КонецЕсли;
		
	Иначе
		
		ВидОперации = Перечисления.бит_ВидыОперацийПодключениеУслугКЗданиям.ПодключениеУслуги;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецОбласти

#КонецЕсли
